//СОБЫТИЯ МЫШИ, КОТОРЫЕ ОТСЛЕЖИВАЮТСЯ БРАУЗЕРОМ


mouseover // событие, когда пользователь НАВОДИТ на елемент
mouseout //увод мыши с елемента
click // клик левой кнопкой мыши
dblclick //двойной щелчек мыши
mousemove //передвижение мыши
mousedown //нажали мышь, но не отпускаете
mouseup //отпускаете мышь после клика



//СОБЫТИЯ С ФОРМАМИ


submit //отправка формы
focus //фокусирование в определенных областях
blur //уходим с поля, убирается фокус
change //изменение
reset //сброс формы
keypress //реакция на клавиатуру, при нажатии на клавиши
keydown //нажатие на клавиши, не отпуская
keyup //опускаем клавишу после нажатия



//СОБЫТИЯ ОКНА БРАУЗЕРА


load // ксобытие, когда брайзер запустил и все загружено с сервера
resize //меняется ширина окна браузера
scroll //прокрутка страницы с помощью мыши или сбоку в браузере
unload //выгрузка, когда закрываем страницы или переходим на другую страницу
